Xml-integration-demo/HotelRQ/20210608102321429DestinationCityList.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><hot:Credentials Password="Sra@12896022" UserName="WESARA"/><wsa:Action>http://TekTravel/HotelBookingApi/DestinationCityList</wsa:Action><wsa:To>https://api.tboholidays.com/HotelApi_V7/HotelService.svc</wsa:To></env:Header><env:Body><DestinationCityListRequest xmlns="http://TekTravel/HotelBookingApi"><CountryCode>BH</CountryCode><ReturnNewCityCodes>true</ReturnNewCityCodes></DestinationCityListRequest></env:Body></env:Envelope>